Repository: KubrickRubrik/FaceTo-Mini-App
Catalog: lib/presentation/ui/components/localization/app_*.arb
Languages: ru

# titleSeriesPage
source: FaceTo Mini series
ru: FaceTo Mini серии

# titleScenesPage
source: Scenes of series
ru: Сцены серии

# titleScenePage
source: Game
ru: Игра

# titleErrorApp
source: Oops!
ru: Упс!

# errorRepairsApp
source: Application needs to be reinstalled
ru: Требуется переустановка приложения

# isNoContent
source: No content
ru: Контент отсутствует

source: Action not available
ru: Действие недоступно

# themeSettings
source: App theme
ru: Тема приложения

# themeSettingsLight
source: Light
ru: Светлая

# themeSettingsDark
source: Dark
ru: Темная

# languageSettings
source: Language
ru: Язык

# soundSettings
source: Voice acting
ru: Озвучка

# soundSettingsOn
source: Turn on
ru: Включить

# soundSettingsOff
source: Switch off
ru: Выключить

# infoSettings
source: Information
ru: Информация

# identificatorSeries
source: Series identifier
ru: Идентификатор серии

# countScenes
source: Scenes in a series
ru: Сцен в серии

# usersSeries
source: Users completed the series
ru: Пользователи завершили серию

# graduallyScenesOpens
source: Scenes of the series open gradually
ru: Сцены серии открываются постепенно

# allScenesOpens
source: All scenes of the series are open
ru: Все сцены серии открыты

# seriesAvailablePlay
source: The series is available to play
ru: Серия доступна для прохождения

source: Series active
ru: Серия активна

source: Series completed
ru: Серия завершена

# simplyLevelDifficult
source: Easy difficulty level. Available diagonal swipe
ru: Простой уровень сложности. Доступный диагональный свайп

# hardLevelDifficult
source: High difficulty. Diagonal swipe not available
ru: Высокий уровень сложности. Диагональный свайп недоступен

# scenesNotAvailable
source: Series scenes are not available
ru: Сцены серии недоступны

source: Scene not available
ru: Сцена недоступна

# lockScene
source: Need to complete the previous scene
ru: Необходимо завершить предыдущую сцену

# infoRatingLabel_1
source: Many different series of images.
ru: Множество разнообразных серий изображений.

# infoRatingLabel_2
source: Downloading series for offline play.
ru: Скачивание серий для игры в офлайн.

# infoRatingLabel_3
source: Setting series ratings.
ru: Установка рейтинга серий.

# infoRatingLabel_4
source: Formation of a list of favorite series.
ru: Формирование списка избранных серий.

# infoRatingLabel_5
source: Subscribe to favorite authors.
ru: Подписка на понравившихся авторов.

# infoRatingLabel_6
source: Formation of the rank and rating of the user.
ru: Формирование ранга и рейтинга пользователя.

# infoRatingLabel_7
source: More features in the Pro version of FaceTo.
ru: Больше возможностей в Pro версии FaceTo.

# infoRatingInstall_1
source: Install Pro version
ru: Установить Pro версию

# infoCopy
source: Copied
ru: Скопировано

# noneAuthorOops
source: Oops!
ru: Упс!

# noneAuthorLabel
source: No information about this author
ru: Нет информации об этом авторе

# rank_1
source: Newbie
ru: Новичок

# rank_2
source: Salaga
ru: Салага

# rank_3
source: Neophyte
ru: Неофит

# rank_4
source: Enthusiast
ru: Энтузиаст

# rank_5
source: Fan
ru: Фанат

# rank_6
source: Decided-Man
ru: Решала

# rank_7
source: Perfectionist
ru: Перфекционист

# rank_8
source: Guru
ru: Гуру

# rank_9
source: Specialist
ru: Специалист

# rank_10
source: Profi
ru: Профи

# rank_11
source: Genius
ru: Гений

# rank_12
source: Legend
ru: Легенда

# rank_13
source: Cyber-cutlet
ru: Кибер-котлета

# rank_14
source: Your majesty
ru: Ваше величество

# rank_15
source: Prophet
ru: Пророк

# rank_16
source: The One
ru: Избранный

# rank_17
source: Titanium
ru: Титан

# rank_18
source: Hand of god
ru: Десница бога

# rank_19
source: God
ru: Бог

# rank_20
source: Enlightened
ru: Просвещенный

# typeAppUser
source: User
ru: Пользователь

# typeAppAuthor
source: –êuthor
ru: Автор

# typeAppCompany
source: Company
ru: Компания

# loadingScene
source: Loading a scene
ru: Загрузка сцены

# labelWinnerScene
source: Record holders
ru: Рекордсмены

# labelWinnerResultScene
source: Your result
ru: Ваш результат

# labelWinnerInfoStatistic
source: Statistics
ru: Статистика

# minDataStatistics
source: Min
ru: Мин

# midDataStatistics
source: Mid
ru: Средн

# maxDataStatistics
source: Max
ru: Макс

# helpBarGraph
source: Distribution of the number of users by skill
ru: Распределение численности пользователей относительно навыков

# helpSwipeBar
source: The ratio of the number of swipes to user time
ru: Соотношение числа свайпов и времени пользователей

# labelGraph_1
source: Skills
ru: Навыки

# labelGraph_2
source: Methodology
ru: Методика

# labelGraph2CoordX
source: Num. of swipes
ru: Кол. свайпов

# labelGraph2CoordY
source: Time in milliseconds
ru: Время в миллисекундах

# playersCharacteristics
source: Characteristics of the players
ru: Характеристика игроков

# playerChar_1
source: Players prefer to rush, take risks and hope for a successful combination, instead of thinking about the next.
ru: Игроки предпочитают спешить, рисковать и надеяться на удачную комбинацию, вместо продумывания следующей.

# playerChar_2
source: Players prefer to think about each combination for a long time and not rush to implement it.
ru: Игроки предпочитают долго обдумывать каждую комбинацию и не спешить с ее реализацией.

# playerChar_3
source: Players prefer not to rush, take risks and stick to cold calculation for the sake of an elegant solution.
ru: Игроки предпочитают не спешить, не рисковать и придерживаются холодного расчета ради элегантного решения.

# playerChar_4
source: Players prefer to think over combinations and are able to go to implementation even if there is no solution.
ru: Игроки предпочитают обдумывать комбинации и способны перейти к реализации даже если решения нет.

# playerCharacteristics
source: Characteristics of the player
ru: Характеристика игрока

# playersChar_1
source: The player makes a lot of unnecessary combinations, is in a hurry: often makes mistakes and poorly predicts the result.
ru: Игрок совершает множество лишних комбинаций, спешит: часто ошибается и плохо прогнозирует результат.

# playersChar_2
source: The player makes a moderate number of combinations: he often makes mistakes and spends a lot of time predicting the result.
ru: Игрок совершает умеренное количество комбинаций: часто ошибается и тратит много времени на прогнозирование результата.

# playersChar_3
source: The player makes a minimum of combinations, is slow: rarely makes mistakes, but spends a lot of time predicting the result.
ru: Игрок совершает минимум комбинаций, медлителен: редко ошибается, но тратит много времени на прогнозирование результата.

# playersChar_4
source: The player makes a moderate number of combinations in the minimum time, is agile: makes few mistakes and predicts the result well.
ru: Игрок совершает умеренное количество комбинаций за минимальное время, проворный: мало ошибается и хорошо прогнозирует результат.

# componentWinnerPlases
source: place
ru: место

# componentWinnerTime
source: Scene time
ru: Время прохождения сцены

# componentWinnerPlus
source: Lagging behind the record holder
ru: Отставание от рекордсмена

# componentWinnerMinus
source: Break away from the next place in the list of record holders
ru: Отрыв от следующего места в списке рекордсменов

# componentWinnerMinTime
source: Record of passing the series
ru: Рекордное время прохождения серии

# componentWinnerDiffTime
source: The difference between the record and the user's time. "+" lagging behind; "-" overtaking.
ru: Разница между рекордом и временем пользователя. "+" отставание; "-" обгон.

# componentWinnerRecord
source: Record
ru: Рекорд

# componentNoneWinner
source: Be the first to set the record in
ru: Поставьте рекорд первым в
